---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NetworkValidityErrorWasDisconnected
source: html/cf94a6f2-be02-cd7d-ae3e-b7a42a9b0e17.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NetworkValidityErrorWasDisconnected Property

The family is connected in a network and can no longer keep the connectivity. Disconnect the family from the network?

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkValidityErrorWasDisconnected { get; }
```